# Parameter Type Id Rebar Type At Start Property

Source: https://www.revitapidocs.com/2026/52625873-3c92-92ef-f313-15e539e76208.htm

---

| Parameter Type Id Rebar Type At Start Property |
| --- |

"Start of Bar"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarTypeAtStart { get; }
```

```
Public Shared ReadOnly Property RebarTypeAtStart As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarTypeAtStart {
	ForgeTypeId^ get ();
}
```

```
static member RebarTypeAtStart : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace